{
  "irVersion": "1.0",
  "project": "omniobserve",
  "repository": "https://github.com/plexusone/omniobserve",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["plexusone"],
  "releases": [
    {
      "version": "v0.8.0",
      "date": "2026-03-14",
      "highlights": [
        { "description": "Unified entry point with HTTP middleware for single-line observability setup" },
        { "description": "sloghandler package with dual output and automatic trace context injection" },
        { "description": "Dynatrace provider and SlogHandler integration across all providers" }
      ],
      "added": [
        { "description": "`omniobserve` package with unified entry point and HTTP middleware", "commit": "4dac7c2" },
        { "description": "Context utilities: `L()`, `O()`, `S()` shortcuts for logger, observability, span", "commit": "4dac7c2" },
        { "description": "`Trace()` and `TraceFunc[T]()` helpers for automatic span management", "commit": "4dac7c2" },
        { "description": "HTTP middleware with spans, metrics, and X-Trace-ID propagation", "commit": "4dac7c2" },
        { "description": "`sloghandler` package with dual output and trace context injection", "commit": "38ca9cc" },
        { "description": "`observops/dynatrace` provider for Dynatrace via OTLP", "commit": "f671b7f" },
        { "description": "`SlogHandler()` method on OTLP, Datadog, and New Relic providers", "commit": "a5f157a" },
        { "description": "`SlogOption` and `SlogConfig` types for handler configuration", "commit": "afd573e" },
        { "description": "`specs` package with OpenSLO, RED metrics, and service classes", "commit": "621ad2a" },
        { "description": "`cmd/genspecs` CLI for JSON Schema generation", "commit": "00eaf6f" }
      ],
      "documentation": [
        { "description": "Provider documentation in `docs/providers/`", "commit": "c1dfba6" },
        { "description": "v0.8.0 release notes", "commit": "dac0c0e" },
        { "description": "Mark Phase 4 unified entry point complete in TASKS.md", "commit": "c6d8e16" },
        { "description": "Add design docs and task tracking", "commit": "29b54a0" }
      ],
      "build": [
        { "description": "Update to shared CI workflows", "commit": "ce26e0d" },
        { "description": "Rename workflow files with `go-` prefix", "commit": "6df4d52" }
      ],
      "dependencies": [
        { "description": "Add OTLP HTTP exporters for metrics and traces", "commit": "f3519a2" },
        { "description": "Add `github.com/OpenSLO/go-sdk` for OpenSLO support", "commit": "f3519a2" },
        { "description": "Update OpenTelemetry SDK to v1.42.0", "commit": "52bfd9c" }
      ]
    },
    {
      "version": "v0.7.0",
      "date": "2026-03-01",
      "highlights": [
        { "description": "Organization rename from agentplexus to plexusone" }
      ],
      "changed": [
        { "description": "**Breaking**: Module path changed from `github.com/agentplexus/omniobserve` to `github.com/plexusone/omniobserve`", "commit": "ea50958" }
      ],
      "documentation": [
        { "description": "Updated all documentation to use new module path", "commit": "71234d3" },
        { "description": "Fix version to v0.7.0 for organization rename", "commit": "e382d72" }
      ],
      "build": [
        { "description": "Fix golangci-lint gofmt issues", "commit": "fed4e84" }
      ],
      "dependencies": [
        { "description": "Upgraded `github.com/plexusone/omnillm` from v0.11.1 to v0.12.0", "commit": "632387e" }
      ]
    },
    {
      "version": "v0.6.0",
      "date": "2026-02-22",
      "highlights": [
        { "description": "Built-in slog provider for local trace logging during development and debugging" },
        { "description": "Structured evaluation integration for connecting llmops with sevaluation workflows" }
      ],
      "added": [
        { "description": "`llmops/slog` provider for local structured logging of trace events", "commit": "9b7dc4e" },
        { "description": "`WithLogger` option in `ClientOptions` for custom slog.Logger configuration", "commit": "9b7dc4e" },
        { "description": "`integrations/sevaluation` package for structured-evaluation integration", "commit": "a7816f6" }
      ],
      "fixed": [
        { "description": "gosec warnings for APIKey struct fields (G117) and HTTP client SSRF (G704)", "commit": "7914c6a" }
      ],
      "documentation": [
        { "description": "Observability integration guide for stats-agent-team", "commit": "4cdffaa" },
        { "description": "README updated with slog provider in supported providers table", "commit": "" }
      ],
      "dependencies": [
        { "description": "Upgraded `github.com/lib/pq` from v1.10.9 to v1.11.1", "commit": "3a1ccde" }
      ]
    },
    {
      "version": "v0.5.1",
      "date": "2026-01-19",
      "highlights": [
        { "description": "Compatibility update for omnillm v0.11.0 with new multi-provider configuration API" }
      ],
      "changed": [
        { "description": "Updated `ClientConfig` usage to new `Providers` slice API for omnillm v0.11.0 compatibility", "commit": "1ff102c" }
      ],
      "dependencies": [
        { "description": "Upgraded `github.com/plexusone/omnillm` from v0.10.0 to v0.11.0", "commit": "1ff102c" }
      ],
      "documentation": [
        { "description": "Converted CHANGELOG to schangelog JSON format with commit references" }
      ]
    },
    {
      "version": "v0.5.0",
      "date": "2026-01-03",
      "highlights": [
        { "description": "Comprehensive evaluation metrics for assessing LLM outputs with both code-based and LLM-based metrics" },
        { "description": "Streamlined provider architecture with Opik and Phoenix adapters moved to standalone SDKs" }
      ],
      "added": [
        { "description": "`AnnotationManager` interface for span/trace annotations with `CreateAnnotation` and `ListAnnotations` methods", "commit": "2baa46f" },
        { "description": "`DatasetManager` methods: `GetDatasetByID` and `DeleteDataset`", "commit": "2baa46f" },
        { "description": "Prompt model/provider options: `WithPromptModel`, `WithPromptProvider`, `ModelName`, `ModelProvider` fields", "commit": "7cea000" },
        { "description": "OmniLLM hook auto-creates traces when none exists in context", "commit": "ef67b89" },
        { "description": "Trace context helpers: `contextWithTrace` and `traceFromContext`", "commit": "7cea000" },
        { "description": "`llmops/metrics` package with LLM-based metrics: `HallucinationMetric`, `RelevanceMetric`, `QACorrectnessMetric`, `ToxicityMetric`", "commit": "079fe35" },
        { "description": "`llmops/metrics` package with code-based metrics: `ExactMatchMetric`, `RegexMetric`, `ContainsMetric`", "commit": "079fe35" },
        { "description": "`examples/evaluation` demonstrating metrics usage", "commit": "f582c2a" }
      ],
      "changed": [
        { "description": "Provider adapters moved to standalone SDKs: Opik to `github.com/plexusone/go-opik/llmops`, Phoenix to `github.com/plexusone/go-phoenix/llmops`", "breaking": true, "commit": "333f6fd" }
      ],
      "removed": [
        { "description": "`llmops/opik` adapter (moved to go-opik)", "commit": "333f6fd" },
        { "description": "`llmops/phoenix` adapter (moved to go-phoenix)", "commit": "333f6fd" },
        { "description": "`sdk/phoenix` package (use go-phoenix directly)", "commit": "333f6fd" }
      ],
      "fixed": [
        { "description": "Redundant newlines in example Println statements", "commit": "6758f68" }
      ],
      "documentation": [
        { "description": "v0.5.0 documentation", "commit": "db6772d" },
        { "description": "Updated presentation HTML", "commit": "05972b1" }
      ],
      "tests": [
        { "description": "Metrics package unit tests", "commit": "526ba8b" }
      ]
    },
    {
      "version": "v0.4.0",
      "date": "2025-12-27",
      "highlights": [
        { "description": "Full-stack observability with new agentops and observops packages for monitoring agentic AI systems" },
        { "description": "Semantic conventions aligned with OpenTelemetry for standardized telemetry across LLM applications" }
      ],
      "added": [
        { "description": "`agentops` package for agent operations monitoring", "commit": "0a0a370" },
        { "description": "`observops` package for unified observability operations", "commit": "8d58179" },
        { "description": "`semconv` package with semantic conventions for agentic AI", "commit": "5fea8e0" }
      ],
      "changed": [
        { "description": "`llmops` refactored to use `github.com/plexusone/omnillm`", "commit": "459d2d7" }
      ],
      "documentation": [
        { "description": "Updated README, docs, and presentation", "commit": "dec1013" }
      ],
      "dependencies": [
        { "description": "Go module dependencies updated", "commit": "4072e07" }
      ]
    },
    {
      "version": "v0.3.0",
      "date": "2025-12-21",
      "highlights": [
        { "description": "Project renamed from observai to omniobserve for consistency with omnillm ecosystem naming" }
      ],
      "changed": [
        { "description": "Project renamed from `observai` to `omniobserve` for consistency with `omnillm` naming conventions", "breaking": true, "commit": "e2b7a86" }
      ]
    },
    {
      "version": "v0.2.0",
      "date": "2025-12-21",
      "highlights": [
        { "description": "FluxLLM integration enables observability for flux-based LLM workflows" }
      ],
      "added": [
        { "description": "`integrations/fluxllm` package for FluxLLM observability", "commit": "ae3869f" }
      ]
    },
    {
      "version": "v0.1.0",
      "date": "2025-12-20",
      "highlights": [
        { "description": "Initial release providing unified observability primitives for LLM applications with OpenTelemetry integration" }
      ],
      "added": [
        { "description": "Core observability framework for LLM applications", "commit": "ce57c34" },
        { "description": "GitHub Actions CI workflow", "commit": "b06ec1b" },
        { "description": "GitHub Pages presentation", "commit": "39f3581" },
        { "description": "MIT License", "commit": "ffec710" }
      ],
      "documentation": [
        { "description": "README with shields and badges", "commit": "63cfe64" }
      ]
    }
  ]
}
